#### Terraform Plan for `test` 📋 ✅ Success

<details><summary>Show Plan</summary>

```terraform
Acquiring state lock. This may take a few moments...
random_string.suffix: Refreshing state... [id=7gcqrr]
data.azurerm_client_config.current: Reading...
azurerm_resource_group.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-afm-oblig2-test]
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0wZDYyZjU3OS05NzE5LTQyYWUtODIzYS05MjJjODkxZDg3NDg7b2JqZWN0SWQ9MTUyMzU0NzgtNTkzOS00MmYyLWE0NzItYzA5ODJhYjBiN2Y4O3N1YnNjcmlwdGlvbklkPWEzYWRmMjBlLTQ5NjYtNGFmYi1iNzE3LTRkZTFiYWFlNmRiMTt0ZW5hbnRJZD04ODhmYTBiMS1mMjQwLTQxYzItYjg0Yi1kZmQ4MTU5NTg5NTg=]
azurerm_storage_account.main: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-afm-oblig2-test/providers/Microsoft.Storage/storageAccounts/stoblig2afmtest7gcqrr]
azurerm_storage_container.demo: Refreshing state... [id=/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-afm-oblig2-test/providers/Microsoft.Storage/storageAccounts/stoblig2afmtest7gcqrr/blobServices/default/containers/demo-data]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_key_vault.main will be created
  + resource "azurerm_key_vault" "main" {
      + access_policy                 = (known after apply)
      + enable_rbac_authorization     = (known after apply)
      + id                            = (known after apply)
      + location                      = "norwayeast"
      + name                          = "kv-afm-oblig2-test"
      + public_network_access_enabled = true
      + purge_protection_enabled      = true
      + rbac_authorization_enabled    = (known after apply)
      + resource_group_name           = "rg-afm-oblig2-test"
      + sku_name                      = "standard"
      + soft_delete_retention_days    = 7
      + tags                          = {
          + "Environment" = "test"
          + "ManagedBy"   = "Anders Flatland Myrvang"
          + "Project"     = "oblig2"
        }
      + tenant_id                     = "888fa0b1-f240-41c2-b84b-dfd815958958"
      + vault_uri                     = (known after apply)

      + contact (known after apply)

      + network_acls (known after apply)
    }

  # azurerm_key_vault_secret.example will be created
  + resource "azurerm_key_vault_secret" "example" {
      + id                      = (known after apply)
      + key_vault_id            = (known after apply)
      + name                    = "example-secret"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + value_wo                = (write-only attribute)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_resource_group.main will be updated in-place
  ~ resource "azurerm_resource_group" "main" {
        id         = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-afm-oblig2-test"
        name       = "rg-afm-oblig2-test"
      ~ tags       = {
            "Environment" = "test"
            "ManagedBy"   = "Anders Flatland Myrvang"
          - "Owner"       = "Anders Flatland Myrvang" -> null
            "Project"     = "oblig2"
        }
        # (2 unchanged attributes hidden)
    }

  # azurerm_storage_account.main will be updated in-place
  ~ resource "azurerm_storage_account" "main" {
      ~ account_replication_type           = "LRS" -> "RAGRS"
        id                                 = "/subscriptions/a3adf20e-4966-4afb-b717-4de1baae6db1/resourceGroups/rg-afm-oblig2-test/providers/Microsoft.Storage/storageAccounts/stoblig2afmtest7gcqrr"
        name                               = "stoblig2afmtest7gcqrr"
      ~ tags                               = {
            "Environment" = "test"
            "ManagedBy"   = "Anders Flatland Myrvang"
          - "Owner"       = "Anders Flatland Myrvang" -> null
            "Project"     = "oblig2"
          - "Test"        = "workflow" -> null
        }
        # (96 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 2 to change, 0 to destroy.
Releasing state lock. This may take a few moments...
```

</details>

**Exit Code:** 0

*Pusher: @AndersMyrvang, Action: `pull_request`, Workflow: `Terraform CI`*